chgpalmer/nrf9151-tracker/tests/fsm/src/main.c
/*
 * loc_fsm unit test: encodes docs/loc-fsm-decision-table.md row by row.
 *
 * The table is normative. Every test names the row(s) it pins (A1, B1, ...).
 * If a test fails after an FSM change, either the change is wrong or the
 * table needs a deliberate edit — never silently adjust the test.
 *
 * The FSM takes its clock as a parameter, so time here is a plain variable:
 * the 300 s acquire timeout costs one addition, not five minutes.
 */
#include <string.h>
#include <zephyr/ztest.h>
#include <nrf_modem_gnss.h>
#include "loc_fsm.h"

/* Internal loc_fsm.c constants without Kconfig symbols, mirrored here.
 * If one changes there, the corresponding row test fails — intended. */
#define SKY_GRACE_MS    30000
#define VISIBLE_LOST_MS 10000
#define CHOPPED_EPOCHS  10
#define EPHE_POLL_MS    5000

#define ACQUIRE_CAP_MS (CONFIG_TRACKER_LOC_ACQUIRE_TIMEOUT_S * 1000)
#define STALE_MS       (CONFIG_TRACKER_GPS_STALE_S * 1000)
#define EMPTY_EPOCHS   CONFIG_TRACKER_LOC_SKY_EMPTY_EPOCHS
#define POST_MS        (CONFIG_TRACKER_POST_INTERVAL_S * 1000)
#define CELL_POST_MS   (CONFIG_TRACKER_CELL_POST_INTERVAL_S * 1000)

#define CN0_STRONG ((CONFIG_TRACKER_LOC_CN0_MIN_DBHZ + 13) * 10)
#define CN0_WEAK   ((CONFIG_TRACKER_LOC_CN0_MIN_DBHZ - 7) * 10)

#define REST_MIN_S CONFIG_TRACKER_REST_BACKOFF_MIN_S
#define REST_MAX_S CONFIG_TRACKER_REST_BACKOFF_MAX_S

/* Mirrors loc_fsm.c's private constant: the inventory floor below which no
 * fix is computable (the C2 cold-with-supply gate keys on it). */
#define SATS_FOR_FIX 4

/* ── fake clock ─────────────────────────────────────────────────────────── */

static int64_t t;
static bool g_stationary;

/* ── fake modem: the one call loc_fsm.c makes ───────────────────────────── */

static struct nrf_modem_gnss_agnss_expiry fake_ephe;
static int32_t fake_ephe_ret;

int32_t nrf_modem_gnss_agnss_expiry_get(struct nrf_modem_gnss_agnss_expiry *out)
{
	if (fake_ephe_ret != 0) {
		return fake_ephe_ret;
	}
	*out = fake_ephe;
	return 0;
}

/* Inventory of n satellites (IDs 1..n) each holding an ephemeris that expires
 * in expiry_min minutes. The FSM polls this at most every EPHE_POLL_MS;
 * set it BEFORE driving (init backdates the poll clock, so the first update
 * always reads it). */
static void set_ephe(int n, uint16_t expiry_min)
{
	memset(&fake_ephe, 0, sizeof(fake_ephe));
	fake_ephe.sv_count = n;
	for (int i = 0; i < n; i++) {
		fake_ephe.sv[i].sv_id = i + 1;
		fake_ephe.sv[i].ephe_expiry = expiry_min;
	}
}

/* ── one 1 Hz epoch ─────────────────────────────────────────────────────── */

#define OBSERVED 0
#define BLANKED  NRF_MODEM_GNSS_PVT_FLAG_DEADLINE_MISSED
#define CHOPPED  NRF_MODEM_GNSS_PVT_FLAG_NOT_ENOUGH_WINDOW_TIME

/* Advance the clock one second and feed one PVT frame. Satellites get IDs
 * 1..tracked so they line up with set_ephe()'s inventory. */
static struct loc_status step_full(bool fix, int tracked, uint16_t cn0,
				   uint32_t flags, bool lte)
{
	struct nrf_modem_gnss_pvt_data_frame pvt = { 0 };
	struct loc_status st;

	pvt.flags = flags | (fix ? NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID : 0);
	for (int i = 0; i < tracked && i < NRF_MODEM_GNSS_MAX_SATELLITES; i++) {
		pvt.sv[i].sv = i + 1;
		pvt.sv[i].cn0 = cn0;
	}

	t += 1000;
	loc_fsm_update(&pvt, t, lte, g_stationary, &st);
	return st;
}

static struct loc_status step(bool fix, int tracked, uint32_t flags)
{
	return step_full(fix, tracked, CN0_STRONG, flags, true);
}

/* Evaluate the status expression exactly once: zassert's message args are
 * function arguments, evaluated even on pass — a bare step() in them would
 * silently run every epoch twice. */
#define ASSERT_STATE(expr, want) do { \
	struct loc_status _st = (expr); \
	zassert_equal(_st.state, (want), "in %s, expected %s", \
		      loc_state_str(_st.state), loc_state_str(want)); \
} while (0)

static void check_outputs(struct loc_status st, enum loc_gnss_mode mode,
			  bool lte, bool publish, uint32_t interval);

/* ── drivers: shortest table-sanctioned path to each state ──────────────── */

static void reset_fsm(void)
{
	t = 1000000;
	g_stationary = false;
	fake_ephe_ret = 0;
	set_ephe(0, 0);
	loc_fsm_init(t);
	/* read_sky()'s ephemeris_visible carries the last OBSERVED value in a
	 * function-static that init cannot reset; every scenario below feeds
	 * tracked > 0 before depending on it, which recomputes it. */
}

static void to_report_cell(void)
{
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_REPORT_CELL); /* A1 */
}

static void to_acquire(void)
{
	to_report_cell();
	loc_fsm_note_cell_sent();
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_GNSS_ACQUIRE); /* B2 */
}

static void to_report_gnss(void)
{
	to_report_cell();
	ASSERT_STATE(step(true, 4, OBSERVED), LOC_REPORT_GNSS); /* B1 */
}

static void to_parked_fix(void)
{
	to_report_gnss();
	g_stationary = true;
	ASSERT_STATE(step(true, 4, OBSERVED), LOC_QUIESCENT); /* E4' */
}

static void to_exclusive(void)
{
	to_acquire();
	for (int i = 0; i < CHOPPED_EPOCHS - 1; i++) {
		ASSERT_STATE(step(false, 0, CHOPPED), LOC_GNSS_ACQUIRE);
	}
	ASSERT_STATE(step(false, 0, CHOPPED), LOC_GNSS_EXCLUSIVE); /* C2 */
}

static void to_cell_loop(void)
{
	to_acquire();
	t += ACQUIRE_CAP_MS;
	ASSERT_STATE(step(false, 1, OBSERVED), LOC_CELL_LOOP); /* C3 */
}

/* Two failed acquisitions while cell-stationary: the no-fix PARKED entry
 * evidence. (to_cell_loop() is the first failure — acquire timeout.) */
static void to_parked_nofix(void)
{
	to_cell_loop();
	ASSERT_STATE(step(false, 1, OBSERVED), LOC_GNSS_ACQUIRE); /* sighted */
	t += ACQUIRE_CAP_MS;
	ASSERT_STATE(step(false, 1, OBSERVED), LOC_CELL_LOOP); /* failure #2 */
	g_stationary = true;
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_QUIESCENT);
}

/* ── LTE_ATTACH / REPORT_CELL ───────────────────────────────────────────── */

ZTEST(loc_fsm, test_a1_registered)
{
	ASSERT_STATE(step_full(false, 0, 0, OBSERVED, false), LOC_LTE_ATTACH);
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_REPORT_CELL);
}

/* A1 clears cell_sent on entry: a latch left over from a previous cycle must
 * not satisfy B2 (F-3 documents that a *queued-stale* cell can; a latch from
 * before this registration cannot). */
ZTEST(loc_fsm, test_a1_clears_stale_cell_sent)
{
	loc_fsm_note_cell_sent();
	to_report_cell();
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_REPORT_CELL);
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_REPORT_CELL);
}

ZTEST(loc_fsm, test_b1_beats_b2)
{
	to_report_cell();
	loc_fsm_note_cell_sent();
	/* Both rows armed: B1 (fix) must win over B2 (cell reported). */
	ASSERT_STATE(step(true, 4, OBSERVED), LOC_REPORT_GNSS);
}

ZTEST(loc_fsm, test_b2_cell_reported)
{
	to_acquire();
}

/* ── GNSS_ACQUIRE ───────────────────────────────────────────────────────── */

