chgpalmer/nrf9151-tracker/tests/fsm/src/main.c
ZTEST(loc_fsm, test_c1_fix)
{
	to_acquire();
	ASSERT_STATE(step(true, 4, OBSERVED), LOC_REPORT_GNSS);
}

ZTEST(loc_fsm, test_c2_chopped_escalates)
{
	to_exclusive();
}

/* One observed clean window resets the chopped streak: escalation needs
 * CHOPPED_EPOCHS *consecutive* chopped epochs. */
ZTEST(loc_fsm, test_c2_clean_window_resets_streak)
{
	to_acquire();
	for (int i = 0; i < CHOPPED_EPOCHS - 1; i++) {
		ASSERT_STATE(step(false, 0, CHOPPED), LOC_GNSS_ACQUIRE);
	}
	ASSERT_STATE(step(false, 1, OBSERVED), LOC_GNSS_ACQUIRE);
	for (int i = 0; i < CHOPPED_EPOCHS - 1; i++) {
		ASSERT_STATE(step(false, 0, CHOPPED), LOC_GNSS_ACQUIRE);
	}
	ASSERT_STATE(step(false, 0, CHOPPED), LOC_GNSS_EXCLUSIVE);
}

/* Parked trackers never escalate to EXCLUSIVE: no urgent fix need, and each
 * escalation costs an LTE deactivate + re-attach (7 pointless cycles in one
 * parked night). Chopped windows while stationary ride out to the C3/C4
 * exits and resolve via CELL_LOOP -> REST. */
ZTEST(loc_fsm, test_c2_stationary_never_escalates)
{
	to_acquire();
	g_stationary = true;
	for (int i = 0; i < 3 * CHOPPED_EPOCHS; i++) {
		ASSERT_STATE(step(false, 0, CHOPPED), LOC_GNSS_ACQUIRE);
	}
	/* ...and the timeout still ends it the parked way. */
	t += ACQUIRE_CAP_MS;
	ASSERT_STATE(step(false, 1, CHOPPED), LOC_CELL_LOOP);
}

/* F-4: a blanked epoch (DEADLINE_MISSED, GNSS never had the radio) neither
 * advances nor resets the chopped streak. */
ZTEST(loc_fsm, test_c2_blanked_carries_chopped_streak)
{
	to_acquire();
	for (int i = 0; i < CHOPPED_EPOCHS - 1; i++) {
		ASSERT_STATE(step(false, 0, CHOPPED), LOC_GNSS_ACQUIRE);
	}
	ASSERT_STATE(step(false, 0, BLANKED), LOC_GNSS_ACQUIRE);
	ASSERT_STATE(step(false, 0, CHOPPED), LOC_GNSS_EXCLUSIVE);
}

/* C2 cold-with-supply gate: an inventory too thin to fix (< SATS_FOR_FIX)
 * plus a live A-GNSS supply refuses the escalation — LTE IS the supply
 * line, and going dark trades a seconds-scale fetch for minutes of 50 bps
 * demodulation (2026-07-12 ride + 2026-07-13 commute: 10-11 min blind
 * each). The C3 timeout still bounds the stay, exiting to CELL_LOOP with
 * LTE up. reset_fsm()'s set_ephe(0,0) is the cold inventory. */
ZTEST(loc_fsm, test_c2_cold_with_supply_never_goes_dark)
{
	loc_fsm_set_agnss_supply(true);
	to_acquire();
	for (int i = 0; i < 3 * CHOPPED_EPOCHS; i++) {
		ASSERT_STATE(step(false, 0, CHOPPED), LOC_GNSS_ACQUIRE);
	}
	t += ACQUIRE_CAP_MS;
	ASSERT_STATE(step(false, 1, CHOPPED), LOC_CELL_LOOP);
}

/* A warm inventory (>= SATS_FOR_FIX ephemerides held) escalates as before:
 * the chop is then genuinely blocking tracking of usable satellites, and
 * radio silence is the correct cure. */
ZTEST(loc_fsm, test_c2_warm_inventory_still_escalates)
{
	loc_fsm_set_agnss_supply(true);
	set_ephe(SATS_FOR_FIX, 60);
	to_acquire();
	for (int i = 0; i < CHOPPED_EPOCHS - 1; i++) {
		ASSERT_STATE(step(false, 0, CHOPPED), LOC_GNSS_ACQUIRE);
	}
	ASSERT_STATE(step(false, 0, CHOPPED), LOC_GNSS_EXCLUSIVE);
}

/* The supply verdict going false mid-hold (agnss lockout after repeated
 * fetch failures) re-opens the escalation: EXCLUSIVE stays available as
 * the genuine no-server fallback. */
ZTEST(loc_fsm, test_c2_supply_lost_restores_escalation)
{
	loc_fsm_set_agnss_supply(true);
	to_acquire();
	for (int i = 0; i < 2 * CHOPPED_EPOCHS; i++) {
		ASSERT_STATE(step(false, 0, CHOPPED), LOC_GNSS_ACQUIRE);
	}
	loc_fsm_set_agnss_supply(false);
	ASSERT_STATE(step(false, 0, CHOPPED), LOC_GNSS_EXCLUSIVE);
}

ZTEST(loc_fsm, test_c3_acquire_timeout)
{
	/* tracked=1 the whole way: a teasing sky must ride out the FULL cap
	 * (sky-empty never fires), then C3 takes it to CELL_LOOP. */
	to_cell_loop();
}

ZTEST(loc_fsm, test_c4_sky_empty_after_grace)
{
	to_acquire();
	/* The streak accumulates during the cold-start grace but must not
	 * exit inside it... */
	for (int i = 0; i < EMPTY_EPOCHS + 2; i++) {
		ASSERT_STATE(step(false, 0, OBSERVED), LOC_GNSS_ACQUIRE);
	}
	/* ...and the first empty epoch past the grace completes the exit. */
	t += SKY_GRACE_MS;
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_CELL_LOOP);
}

/* F-4, the core case: blanked epochs pause the empty-sky count — absence of
 * observation is not observation of absence. */
ZTEST(loc_fsm, test_c4_blanked_pauses_empty_streak)
{
	to_acquire();
	t += SKY_GRACE_MS; /* past the grace; only the streak matters now */
	for (int i = 0; i < EMPTY_EPOCHS - 1; i++) {
		ASSERT_STATE(step(false, 0, OBSERVED), LOC_GNSS_ACQUIRE);
	}
	for (int i = 0; i < 20; i++) {
		ASSERT_STATE(step(false, 0, BLANKED), LOC_GNSS_ACQUIRE);
	}
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_CELL_LOOP);
}

/* A sighting resets the empty streak: giving up needs CONSECUTIVE observed
 * emptiness. */
ZTEST(loc_fsm, test_c4_sighting_resets_empty_streak)
{
	to_acquire();
	t += SKY_GRACE_MS;
	for (int i = 0; i < EMPTY_EPOCHS - 1; i++) {
		ASSERT_STATE(step(false, 0, OBSERVED), LOC_GNSS_ACQUIRE);
	}
	ASSERT_STATE(step(false, 1, OBSERVED), LOC_GNSS_ACQUIRE);
	for (int i = 0; i < EMPTY_EPOCHS - 1; i++) {
		ASSERT_STATE(step(false, 0, OBSERVED), LOC_GNSS_ACQUIRE);
	}
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_CELL_LOOP);
}

/* ── GNSS_EXCLUSIVE ─────────────────────────────────────────────────────── */

/* D-rows run with lte_registered=false throughout — registration lapsing is
 * the point of the state, and the global override must NOT bounce it. */

ZTEST(loc_fsm, test_d1_fix)
{
	to_exclusive();
	ASSERT_STATE(step_full(false, 0, 0, OBSERVED, false), LOC_GNSS_EXCLUSIVE);
	ASSERT_STATE(step_full(true, 4, CN0_STRONG, OBSERVED, false),
		     LOC_REPORT_GNSS);
}

ZTEST(loc_fsm, test_d2_timeout)
{
	to_exclusive();
	t += ACQUIRE_CAP_MS;
	ASSERT_STATE(step_full(false, 1, CN0_WEAK, OBSERVED, false),
		     LOC_CELL_LOOP);
}

ZTEST(loc_fsm, test_d3_sky_empty)
{
	to_exclusive();
	t += SKY_GRACE_MS;
	for (int i = 0; i < EMPTY_EPOCHS - 1; i++) {
		ASSERT_STATE(step_full(false, 0, 0, OBSERVED, false),
			     LOC_GNSS_EXCLUSIVE);
	}
	ASSERT_STATE(step_full(false, 0, 0, OBSERVED, false), LOC_CELL_LOOP);
}

/* ── global override ────────────────────────────────────────────────────── */

ZTEST(loc_fsm, test_override_from_report_cell)
{
	to_report_cell();
	ASSERT_STATE(step_full(false, 0, 0, OBSERVED, false), LOC_LTE_ATTACH);
}

ZTEST(loc_fsm, test_override_from_acquire)
{
	to_acquire();
	ASSERT_STATE(step_full(false, 0, 0, OBSERVED, false), LOC_LTE_ATTACH);
}

ZTEST(loc_fsm, test_override_from_report_gnss)
{
	to_report_gnss();
	ASSERT_STATE(step_full(true, 4, CN0_STRONG, OBSERVED, false),
		     LOC_LTE_ATTACH);
}

ZTEST(loc_fsm, test_override_from_cell_loop)
{
	to_cell_loop();
	ASSERT_STATE(step_full(false, 0, 0, OBSERVED, false), LOC_LTE_ATTACH);
}

/* ── REPORT_GNSS ────────────────────────────────────────────────────────── */

ZTEST(loc_fsm, test_e1_sky_lost)
{
	to_report_gnss();
	/* Observed-empty epochs: the streak passes EMPTY_EPOCHS long before
	 * the fix goes stale, so the moment it does, E1 (not E2) fires. */
	for (int i = 1; i < STALE_MS / 1000; i++) {
		ASSERT_STATE(step(false, 0, OBSERVED), LOC_REPORT_GNSS);
	}
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_CELL_LOOP);
}

ZTEST(loc_fsm, test_e2_stale_hotstart_dead)
{
	/* No ephemeris inventory at all: satellites are tracked (so the sky
	 * is not empty) but none can seed a hot start. */
	to_report_gnss();
	for (int i = 1; i < STALE_MS / 1000; i++) {
		ASSERT_STATE(step(false, 3, OBSERVED), LOC_REPORT_GNSS);
	}
	ASSERT_STATE(step(false, 3, OBSERVED), LOC_GNSS_ACQUIRE);
}

ZTEST(loc_fsm, test_e3_stale_but_hotstart_viable_waits)
{
	struct loc_status st;

	/* 4 tracked satellites with valid ephemeris: a re-fix is a hot start,
	 * so REPORT_GNSS waits — indefinitely — instead of disturbing LTE. */
	set_ephe(4, 120);
	to_report_gnss();
	for (int i = 1; i <= STALE_MS / 1000 + 10; i++) {
		st = step(false, 4, OBSERVED);
		ASSERT_STATE(st, LOC_REPORT_GNSS);
	}
	zassert_false(st.gps_current, "fix should be stale by now");
	zassert_true(st.prefer_cell, "stale fix must fall back to cell");
	/* The awaited re-fix arrives: still REPORT_GNSS, GPS preferred again. */
	st = step(true, 4, OBSERVED);
	ASSERT_STATE(st, LOC_REPORT_GNSS);
	zassert_false(st.prefer_cell, "current fix must prefer GPS");
}

