chgpalmer/nrf9151-tracker/tests/fsm/src/main.c
/* F-1 regression: a current fix with ephemeris about to expire must STAY in
 * REPORT_GNSS. The deleted E4 transition bounced to ACQUIRE and back at 1 Hz
 * for the whole refresh window — two INF lines per second onto the uplink. */
ZTEST(loc_fsm, test_f1_expiring_ephemeris_never_exits)
{
	struct loc_status st;

	set_ephe(4, 5); /* well under the old 15 min refresh threshold */
	to_report_gnss();
	for (int i = 0; i < 3 * EPHE_POLL_MS / 1000; i++) {
		st = step(true, 4, OBSERVED);
		ASSERT_STATE(st, LOC_REPORT_GNSS);
	}
	/* Prove the trap was actually armed, not vacuously green. */
	zassert_equal(st.ephemeris_held, 4, "expected 4 held, got %u",
		      st.ephemeris_held);
	zassert_equal(st.min_ephe_expiry_min, 5, "expected expiry 5, got %u",
		      st.min_ephe_expiry_min);
}

/* ── PARKED, fix flavor (legacy: periodic checks) ───────────────────────── */

ZTEST(loc_fsm, test_p_entry_requires_stationary_and_fix)
{
	to_report_gnss();
	/* moving: stays put no matter how long */
	for (int i = 0; i < 30; i++) {
		ASSERT_STATE(step(true, 4, OBSERVED), LOC_REPORT_GNSS);
	}
	g_stationary = true;
	ASSERT_STATE(step(true, 4, OBSERVED), LOC_QUIESCENT);
}

ZTEST(loc_fsm, test_p1_motion_resumes_tracking)
{
	to_parked_fix();
	g_stationary = false;
	ASSERT_STATE(step(true, 4, OBSERVED), LOC_REPORT_GNSS);
}

/* Staleness is cadence-aware: a fix is current until 3 check intervals
 * pass without one, not 30 s. And the sky-empty evidence is NOT evaluated
 * here — empty checks lead to ACQUIRE via staleness, never to CELL_LOOP. */
ZTEST(loc_fsm, test_p2_checks_not_fixing)
{
	to_parked_fix();
	/* six observed-empty epochs: >SKY_EMPTY_EPOCHS, way past 30 s-stale —
	 * both would have fired in REPORT_GNSS; QUIESCENT must hold. */
	for (int i = 0; i < EMPTY_EPOCHS + 1; i++) {
		ASSERT_STATE(step(false, 0, OBSERVED), LOC_QUIESCENT);
	}
	/* ...but three missed checks means the parked spot lost its sky. */
	t += 3 * (int64_t)CONFIG_TRACKER_QUIESCENT_CHECK_S * 1000;
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_GNSS_ACQUIRE);
}

ZTEST(loc_fsm, test_p_fix_outputs)
{
	struct loc_status st;

	to_parked_fix();
	st = step(true, 4, OBSERVED);
	ASSERT_STATE(st, LOC_QUIESCENT);
	check_outputs(st, LOC_GNSS_PERIODIC, true, true,
		      (uint32_t)CONFIG_TRACKER_QUIESCENT_CHECK_S * 1000);
	zassert_equal(st.gnss_interval_s, CONFIG_TRACKER_QUIESCENT_CHECK_S,
		      "check interval");
	zassert_false(st.prefer_cell, "parked with fix: GPS, not cell");
}

ZTEST(loc_fsm, test_p_override_registration_loss)
{
	to_parked_fix();
	ASSERT_STATE(step_full(true, 4, CN0_STRONG, OBSERVED, false),
		     LOC_LTE_ATTACH);
}

/* ── CELL_LOOP ──────────────────────────────────────────────────────────── */

ZTEST(loc_fsm, test_g1_fix_returned)
{
	to_cell_loop();
	ASSERT_STATE(step(true, 4, OBSERVED), LOC_REPORT_GNSS);
}

/* G2: ONE tracked satellite — however weak, even in a chopped window —
 * earns a real acquisition attempt. Chopped windows understate the sky. */
ZTEST(loc_fsm, test_g2_single_weak_sighting)
{
	to_cell_loop();
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_CELL_LOOP);
	ASSERT_STATE(step(false, 0, BLANKED), LOC_CELL_LOOP);
	ASSERT_STATE(step_full(false, 1, CN0_WEAK, CHOPPED, true),
		     LOC_GNSS_ACQUIRE);
}

/* ── PARKED, no-fix flavor (legacy: backoff retries + heartbeat) ────────── */

ZTEST(loc_fsm, test_p_nofix_entry_needs_two_failures)
{
	to_cell_loop(); /* one failure only */
	g_stationary = true;
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_CELL_LOOP);
}

ZTEST(loc_fsm, test_p_nofix_entry_needs_stationary)
{
	to_cell_loop();
	ASSERT_STATE(step(false, 1, OBSERVED), LOC_GNSS_ACQUIRE);
	t += ACQUIRE_CAP_MS;
	ASSERT_STATE(step(false, 1, OBSERVED), LOC_CELL_LOOP);
	/* two failures but moving: keep trying, never rest */
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_CELL_LOOP);
}

/* A check landing a fix upgrades the flavor IN PLACE: the old REST bounced
 * REST -> REPORT_GNSS -> QUIESCENT, two transitions narrating nothing. */
ZTEST(loc_fsm, test_p_nofix_fix_upgrades_in_place)
{
	struct loc_status st;

	to_parked_nofix();
	st = step(true, 4, OBSERVED);
	ASSERT_STATE(st, LOC_QUIESCENT);
	zassert_true(st.gps_current, "fix taken");
	zassert_equal(st.gnss_interval_s, CONFIG_TRACKER_QUIESCENT_CHECK_S,
		      "flavor upgraded to periodic checks");
	zassert_false(st.prefer_cell, "parked with fix: GPS, not cell");
}

ZTEST(loc_fsm, test_p_nofix_sighting_earns_acquire)
{
	to_parked_nofix();
	ASSERT_STATE(step(false, 1, OBSERVED), LOC_GNSS_ACQUIRE);
}

ZTEST(loc_fsm, test_p_nofix_motion_exits_and_resets_backoff)
{
	struct loc_status st;

	to_parked_nofix();
	/* grow the backoff first */
	t += (int64_t)REST_MIN_S * 1000;
	st = step(false, 0, OBSERVED);
	ASSERT_STATE(st, LOC_QUIESCENT);
	zassert_equal(st.gnss_interval_s, 2 * REST_MIN_S, "doubled");
	g_stationary = false;
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_GNSS_ACQUIRE);
	/* fail again twice, re-enter REST: backoff starts at MIN again */
	t += ACQUIRE_CAP_MS;
	ASSERT_STATE(step(false, 1, OBSERVED), LOC_CELL_LOOP);
	ASSERT_STATE(step(false, 1, OBSERVED), LOC_GNSS_ACQUIRE);
	t += ACQUIRE_CAP_MS;
	ASSERT_STATE(step(false, 1, OBSERVED), LOC_CELL_LOOP);
	g_stationary = true;
	st = step(false, 0, OBSERVED);
	ASSERT_STATE(st, LOC_QUIESCENT);
	zassert_equal(st.gnss_interval_s, (uint32_t)REST_MIN_S, "backoff reset");
}

ZTEST(loc_fsm, test_p_nofix_backoff_doubles_to_cap)
{
	struct loc_status st;
	uint32_t expect = REST_MIN_S;

	to_parked_nofix();
	while (expect < REST_MAX_S) {
		t += (int64_t)expect * 1000;
		st = step(false, 0, OBSERVED);
		ASSERT_STATE(st, LOC_QUIESCENT);
		expect = MIN(expect * 2, (uint32_t)REST_MAX_S);
		zassert_equal(st.gnss_interval_s, expect, "backoff step");
	}
	/* at the cap it stays there */
	t += (int64_t)REST_MAX_S * 1000;
	st = step(false, 0, OBSERVED);
	zassert_equal(st.gnss_interval_s, (uint32_t)REST_MAX_S, "capped");
}

/* One wake delivers several PVT frames (the retry window); the backoff
 * must double once per wake, not once per frame. */
ZTEST(loc_fsm, test_p_nofix_backoff_once_per_wake)
{
	struct loc_status st;

	to_parked_nofix();
	t += (int64_t)REST_MIN_S * 1000;
	st = step(false, 0, OBSERVED); /* first frame of the wake: doubles */
	zassert_equal(st.gnss_interval_s, 2 * REST_MIN_S, "first frame");
	st = step(false, 0, OBSERVED); /* second frame, 1 s later: no change */
	zassert_equal(st.gnss_interval_s, 2 * REST_MIN_S, "second frame");
}

