chgpalmer/nrf9151-tracker/tests/fsm/src/main.c
ZTEST(loc_fsm, test_p_nofix_outputs)
{
	struct loc_status st;

	to_parked_nofix();
	st = step(false, 0, OBSERVED);
	ASSERT_STATE(st, LOC_QUIESCENT);
	check_outputs(st, LOC_GNSS_PERIODIC, true, true,
		      (uint32_t)CONFIG_TRACKER_REST_HEARTBEAT_S * 1000);
	zassert_true(st.prefer_cell, "no-fix PARKED publishes heartbeat cells");
}

ZTEST(loc_fsm, test_p_nofix_override_registration_loss)
{
	to_parked_nofix();
	ASSERT_STATE(step_full(false, 0, 0, OBSERVED, false), LOC_LTE_ATTACH);
}

ZTEST(loc_fsm, test_failures_reset_on_fix)
{
	/* A successful check-fix clears the failure count (and upgrades the
	 * flavor): after going stale again, CELL_LOOP needs two FRESH
	 * failures before parking no-fix. */
	to_parked_nofix();
	ASSERT_STATE(step(true, 4, OBSERVED), LOC_QUIESCENT); /* upgraded */
	t += 3 * (int64_t)CONFIG_TRACKER_QUIESCENT_CHECK_S * 1000;
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_GNSS_ACQUIRE);
	t += ACQUIRE_CAP_MS;
	ASSERT_STATE(step(false, 1, OBSERVED), LOC_CELL_LOOP); /* failure #1 */
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_CELL_LOOP); /* needs two */
}

/* ── PARKED, IMU mode (GNSS off; the accelerometer owns departure) ──────── */

ZTEST(loc_fsm, test_pi_gnss_off_and_heartbeat)
{
	struct loc_status st;

	loc_fsm_set_imu_wake(true);
	to_parked_fix();
	st = step(true, 4, OBSERVED); /* frozen-frame artifacts change nothing */
	ASSERT_STATE(st, LOC_QUIESCENT);
	check_outputs(st, LOC_GNSS_OFF, true, true,
		      (uint32_t)CONFIG_TRACKER_REST_HEARTBEAT_S * 1000);
	zassert_equal(st.gnss_interval_s, 0, "no periodic checks");
}

/* No GNSS evidence can move an IMU-parked tracker: not staleness, not
 * sightings, not fixes. The ONLY exits are the stationary verdict (IMU,
 * via motion.c) and the registration-loss override. */
ZTEST(loc_fsm, test_pi_ignores_gnss_evidence)
{
	loc_fsm_set_imu_wake(true);
	to_parked_fix();
	t += 3 * (int64_t)CONFIG_TRACKER_QUIESCENT_CHECK_S * 1000; /* stale */
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_QUIESCENT);
	ASSERT_STATE(step(false, 3, OBSERVED), LOC_QUIESCENT); /* sighting */
	ASSERT_STATE(step(true, 4, OBSERVED), LOC_QUIESCENT);  /* stray fix */
	t += 24 * 60 * 60 * 1000; /* a full parked day */
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_QUIESCENT);
}

/* IMU wake goes to REPORT_CELL, NOT ACQUIRE: the server must learn of the
 * movement (alert + free cell fix) and the A-GNSS fetch must run before the
 * radio-silent acquisition. The wake path is the boot path. */
ZTEST(loc_fsm, test_pi_motion_wakes_to_report_cell)
{
	loc_fsm_set_imu_wake(true);
	to_parked_fix();
	g_stationary = false; /* motion_note_imu()'s verdict flip */
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_REPORT_CELL);
	/* ...and REPORT_CELL then walks the normal boot path to ACQUIRE. */
	loc_fsm_note_cell_sent();
	ASSERT_STATE(step(false, 0, OBSERVED), LOC_GNSS_ACQUIRE);
}

ZTEST(loc_fsm, test_pi_nofix_entry_also_off)
{
	struct loc_status st;

	loc_fsm_set_imu_wake(true);
	to_parked_nofix();
	st = step(false, 0, OBSERVED);
	ASSERT_STATE(st, LOC_QUIESCENT);
	zassert_equal(st.gnss_mode, LOC_GNSS_OFF, "GNSS off, no-fix flavor too");
	zassert_true(st.prefer_cell, "heartbeat cells");
}

ZTEST(loc_fsm, test_pi_override_registration_loss)
{
	loc_fsm_set_imu_wake(true);
	to_parked_fix();
	ASSERT_STATE(step_full(false, 0, 0, OBSERVED, false), LOC_LTE_ATTACH);
}

/* ── outputs table ──────────────────────────────────────────────────────── */

static void check_outputs(struct loc_status st, enum loc_gnss_mode mode,
			  bool lte, bool publish, uint32_t interval)
{
	zassert_equal(st.gnss_mode, mode, "%s: gnss_mode",
		      loc_state_str(st.state));
	zassert_equal(st.lte_wanted, lte, "%s: lte_wanted",
		      loc_state_str(st.state));
	zassert_equal(st.publish_allowed, publish, "%s: publish_allowed",
		      loc_state_str(st.state));
	zassert_equal(st.publish_interval_ms, interval, "%s: interval",
		      loc_state_str(st.state));
}

ZTEST(loc_fsm, test_outputs_by_state)
{
	struct loc_status st;

	st = step_full(false, 0, 0, OBSERVED, false); /* LTE_ATTACH */
	check_outputs(st, LOC_GNSS_OFF, true, false, POST_MS);

	st = step(false, 0, OBSERVED); /* -> REPORT_CELL */
	check_outputs(st, LOC_GNSS_CONTINUOUS, true, true, POST_MS);
	zassert_true(st.prefer_cell, "REPORT_CELL: prefer_cell");

	loc_fsm_note_cell_sent();
	st = step(false, 0, OBSERVED); /* -> GNSS_ACQUIRE */
	check_outputs(st, LOC_GNSS_CONTINUOUS, true, false, POST_MS);

	for (int i = 0; i < CHOPPED_EPOCHS; i++) {
		st = step(false, 0, CHOPPED); /* -> GNSS_EXCLUSIVE */
	}
	ASSERT_STATE(st, LOC_GNSS_EXCLUSIVE);
	/* gnss stays CONTINUOUS even though registration lapses: the
	 * exception written into the output rule. */
	st = step_full(false, 0, 0, OBSERVED, false);
	check_outputs(st, LOC_GNSS_CONTINUOUS, false, false, POST_MS);

	st = step_full(true, 4, CN0_STRONG, OBSERVED, false); /* -> REPORT_GNSS */
	ASSERT_STATE(st, LOC_REPORT_GNSS);
	st = step(true, 4, OBSERVED);
	check_outputs(st, LOC_GNSS_CONTINUOUS, true, true, POST_MS);
	zassert_false(st.prefer_cell, "REPORT_GNSS+fix: prefer_cell");

	reset_fsm();
	to_cell_loop();
	st = step(false, 0, OBSERVED);
	ASSERT_STATE(st, LOC_CELL_LOOP);
	check_outputs(st, LOC_GNSS_CONTINUOUS, true, true, CELL_POST_MS);
	zassert_true(st.prefer_cell, "CELL_LOOP: prefer_cell");
}

/* ── suite ──────────────────────────────────────────────────────────────── */

static void before_each(void *fixture)
{
	ARG_UNUSED(fixture);
	reset_fsm();
}

ZTEST_SUITE(loc_fsm, NULL, NULL, before_each, NULL, NULL);
